Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotCopyNoAttachedParentWarn Property
 Attached Detail Group can't be copied without its Model Group
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCopyNoAttachedParentWarn { get; }
Visual Basic
Public Shared ReadOnly Property CannotCopyNoAttachedParentWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCopyNoAttachedParentWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace